sp = {'Москва Хьюстон Дубаи': '1656841/766a66e42965517d47e8', 'Париж Токио Лас-вегас': '1533899/d88f03a71317d38313f7',
      'Сидней Мельбурн Канберра': '1652229/4b764915f09574e4c1e8',
      'Сан-Франциско Чикаго Нью-Йорк': '965417/5c68c9d56065e29d4a21',
      'Амстердам Осло Прага': '965417/70cd17190ff72bec6f20',
      'Афины Тира Крит': '1030494/6d8fe24d8775569d24f1', 'Бухара Самарканд Ташкент': '1521359/e37d72fc07472d093f85',
      'Венеция Флоренция Рим': '1540737/5b4002334460b6316f32',
      'Волгоград Саратов Владимир': '965417/3921f88a8f202517f990',
      'Гаванна Монтевидео Крит': '1030494/2fdfdfbef95e0a6dbaad',
      'Дели Мумбаи Калькутта': '1540737/cec5115bc7c923155d80',
      'Куала-Лумпур Сингапур Бангкок': '965417/c0340b966e96d08aaf21',
      'Лондон Париж Москва': '1540737/50a06e2150df9e9ec2c3',
      'Мадрид Барселона Валенсия': '965417/2faf1b57a5852e1cc44c',
      'Нью-Йорк Чикаго Сан-Франциско': '965417/b481db8d9100b399357e',
      'Пекин Шанхай Сеул': '1652229/7a351740a1919f37b09f', 'Прага Берлин Варшава': '1030494/b938c0e18743b107be93',
      'Рим Милан Флоренция': '213044/1bf5a9b70ed555f5785a',
      'Рио-де-Жанейро Бразилиа Барселона': '965417/0cc19f41e8137e0f91a3',
      'Санкт-Петербург Венеция Москва': '1540737/0286fc0dac30e7c5cfd2',
      'Сан-Франциско Калифорния Чикаго': '1030494/09d7a430b39e95ffb974',
      'Сингапур Сеул Куала-Лумпур': '1030494/cdfbff2f9c05ad1a0d1f',
      'Стамбул Анталья Анкара': '1652229/e3ccbc55db3bf11e30b6', 'Токио Пекин Сеул': '997614/a76304568f2dbc241444'}

while True:
    n = input()
    if n == '0':
        break
    n = n.split('*')
    sp[n[0].strip()] = n[1].strip()

print(sp)
